# -*- coding: utf-8 -*-
import numpy as np

#======================================================
# 多維陣列形狀 Shape

arr_1d = np.arange(1, 9)
arr_1d.shape    # Output: (8,)

arr_2d = np.array([
    [1, 2, 3, 4],
    [5, 6, 7, 8]
])
arr_2d.shape()  # Output: (2, 4)

arr_3d = np.array([
    [
        [1, 2],
        [3, 4]
    ], [
        [5, 6],
        [7, 8]
    ]
])
arr_3d.shape    # Output: (2, 2, 2)

#======================================================
# 資料形狀操作

#------------------------------------------------
# 資料轉置
# 將欄列對調

data = np.array([
    [2, 4, 1],
    [1, 5, 0]
])

data.shape      # Output: (2, 3)
data.T.shape    # Output: (3, 2)
data.T          # Output: array([[2, 1],
                #                [4, 5],
                #                [1, 0]])

#------------------------------------------------
# 扁平化資料
# 多維陣列打平成一維陣列

data = np.array([
    [[1, 2], [3, 4]],
    [[5, 6], [7, 8]]
])

data.ravel()    # Output: array([1, 2, 3, 4, 5, 6, 7, 8])

#------------------------------------------------
# 重塑資料形狀
# 但資料總數量需要一樣

data = np.array([   # 資料總數： 2 x 2 x 2 = 8
    [[1, 2], [3, 4]],
    [[5, 6], [7, 8]]
])

# 改成二維陣列
data.reshape(4, 2)  # 資料總數： 4 x 2 = 8，可重塑
                    # Output: array([[1, 2],
                    #                [3, 4],
                    #                [5, 6],
                    #                [7, 8]])

# data.reshape(3, 3)  # 資料總數： 4 x 2 = 8，不可重塑

data = np.zeros(18).reshape(2, 3, 3)    # Output: array([[[0., 0., 0.],
                                        #                 [0., 0., 0.],
                                        #                 [0., 0., 0.]],

                                        #                 [[0., 0., 0.],
                                        #                 [0., 0., 0.],
                                        #                 [0., 0., 0.]]])

